{
    "data/txt/Minutes05192021.txt": [
        "meeting the full list of vendors that have been paid so far.  Mr. Smith asked her to report \n",
        "lingers that may not show up in a list of files.  Ms. Salyers stated that Netpoint said fixing \n"
    ],
    "data/txt/Minutes11192021.txt": [
        "minor issues.  The first issue was that we had to remove a poll worker from a polling \n"
    ],
    "data/txt/Minutes11182024.txt": [
        "There are 69 absentee ballots received after the election that are eligible to be counted.  \n",
        "Ms. James stated that 20 absentee ballots received after the election are not eligible to be \n",
        "Election Day.  All four would have been eligible for counting.   \n",
        "days of Election Day and did not provide proof of their name change.  All 30 are eligible to \n",
        "we must place the voter in provisional status.  All 33 are eligible for counting.  Ms. Groot \n",
        "that none of them returned their absentee ballots for counting.  All 51 are eligible for \n",
        "not vote there.   All 167 are eligible for counting.  Ms. Groot motioned to count the 167 \n",
        "valid photo ID to BOE staff members.  Therefore, their provisionals are eligible to be \n",
        "registration database.  None are eligible to be counted, but as long as they completed their \n",
        "envelopes are not complete, the ballots are not eligible for counting.   \n",
        "staff opened and scanned eligible ballots.   \n",
        "identification number contained in the statewide voter registration database.   \n"
    ],
    "data/txt/Minutes11062023and11072023.txt": [
        "Ms. Grubbe commented on the voters who were removed from the rolls in September.  She \n",
        "envelope correctly, then their provisional ballot would be eligible for counting.  Ms. \n",
        "She also said signs would be posted on our door.  Ms. Grubbe asked for a list of PEOs, \n"
    ],
    "data/txt/Minutes02242023.txt": [
        "open and fewer than 200 voters are eligible to vote, you can move those voters to a \n",
        "eligible to vote in May.  The third precinct is Vermilion Township 5.  Currently there are \n",
        "16 voters in that precinct who are eligible to vote in May.   \n",
        "Ms. James proposed that we move any eligible voters in Huron Township 1 to the Eagles \n",
        "Club, any eligible voters in Margaretta Township 3 to the Groton Township Building, and \n",
        "any eligible voters in Vermilion Township 5 to the Berlin Heights Municipal Building.  We \n",
        "Hinners stated the key is that the livestreaming does not remove the obligation to provide \n",
        "Ms. Grubbe asked about new voter registration forms due to the new law and whether they \n",
        "printed new voter registration forms.  Ms. James stated she would check the directive to \n",
        "Ms. Grubbe stated she would like a list of the voters who are going to be purged.  Ms. \n",
        "James stated they would not be removed until after the February special election and that \n",
        "she would email Ms. Grubbe the list.   \n",
        "Ms. Grubbe stated that she went on the BOE website to see a list of Republican central \n",
        "committee members and that Theresa Gavarone is listed as a central committee person for \n",
        "Huron A, even though she’s back in Wood County.  Ms. James stated we would remove her \n"
    ],
    "data/txt/Minutes07212020.txt": [
        "county, this means that currently, only about 29 percent are eligible to serve as elections \n"
    ],
    "data/txt/Minutes11012021and11022021.txt": [
        "address in our voter registration system from Vermilion 2-B to Vermilion Township #1.  \n"
    ],
    "data/txt/Minutes07282023.txt": [
        "engage in other voter activity before they are removed from the voter rolls.  Mr. Jones \n",
        "listed have enough valid signatures to appear on the ballot.  Mr. Monaghan asked if the \n",
        "people listed on the petitions were the only ones running.  Mr. Jones replied that the people \n",
        "listed are the ones who filed petitions after the last meeting.  He stated that the deadline to \n"
    ],
    "data/txt/Minutes10252024.txt": [
        "in Chapter 4 on voter registration, it states, “The determination of a physician or other \n"
    ],
    "data/txt/Minutes03262021.txt": [
        "Topaz signature pads for early voting.  Triad, our voter registration company, came up \n",
        "Ms. Grubbe said thank you, and asked to be included on the email list for when special \n"
    ],
    "data/txt/Minutes11182020.txt": [
        "to him that he create a list with the other board members of some protocols for the board \n",
        "this in the list of protocols to be adopted later.   \n"
    ],
    "data/txt/Minutes09242021.txt": [
        "removed the early voting laptops and installed the topaz signature pads for early voting.  \n",
        "I have forwarded the findings of the ADA specialist from the Secretary of State’s office, \n"
    ],
    "data/txt/Minutes01312020.txt": [
        "problems with direct access to the voter registration cards being right over the counter.   \n",
        "Mr. Gross stated that we have a voter registration hearing in a few minutes.  Did \n",
        "challenge it in court.  The previous decision is effective until the person presents changed \n"
    ],
    "data/txt/Minutes12152023.txt": [
        "Election.  Mr. Jones noted that all candidates listed meet the necessary requirements to be \n",
        "that if someone turns in an incomplete voter registration form, we send them a letter.  She \n"
    ],
    "data/txt/Minutes01282022.txt": [
        "Adrienne James, Deputy Director, stated that she gave the board members a list of all \n",
        "signatures.  All the other names on the list are people who completed paperwork to run for \n",
        "Motion to certify the candidates on the list except for Mr. Monaghan and Mr. Krabill was \n",
        "made by Mr. Smith, seconded by Mr. Monaghan.  Motion carried.  The list of candidates \n",
        "of the challenges we faced at the Sandusky Cultural Center polling location last November.  \n"
    ],
    "data/txt/Minutes11192024.txt": [
        "training materials and found a provisional voting checklist.  Part of the checklist reads, \n",
        "“The voter will complete the 12B envelope and voter registration form if needed.  The \n"
    ],
    "data/txt/Minutes09242020.txt": [
        "own money to send out a correction to everyone on their mailing list.  Ms. Grubbe stated \n",
        "Ms. Grubbe then asked for a list of poll workers that included their names, addresses, \n",
        "called later.  Ms. Grubbe then asked if the Democrats and Republicans from that list had \n"
    ],
    "data/txt/Minutes01152021.txt": [
        "work does not get done, and the election is not successful, the SOS removes the board and \n"
    ],
    "data/txt/Minutes05132020.txt": [
        "Therefore, these ballots are eligible to be counted.  Motion to count these ballots was made \n",
        "Ms. James then moved on to absentee ballots that were not eligible to be counted.  The first \n",
        "returned after April 28 at 7:30 p.m., so it was not eligible to be counted.  The other one was \n",
        "that the ballots were not eligible to be counted, because the ballots must be turned into the \n",
        "removed from Erie County because of the “purge,” but the address that they indicated on \n",
        "for the ballot to be eligible.”  Ms. Link also pointed out that when a person registers to \n",
        "voter registration form.  Mr. Krabill then rescinded his motion and moved not to count the \n",
        "stated that the voters were removed from Erie County as a result of the purge, but they \n",
        "address on file before they were removed.  Motion to count these ballots was made by Mr. \n",
        "were in a provisional status in the voter registration system due to an undeliverable \n",
        "example, they were registered in the voter registration system with one last name, put a \n",
        "they live on 126 Wayne Street, which is an address not listed in the voter registration \n"
    ],
    "data/txt/Minutes05252022.txt": [
        "down.  She also created check-lists for the VLMs, such as a check-list for assisting \n",
        "provisional voters and a check-list for end-of-night procedures.  Ms. Salyers also stated we \n",
        "have now fixed that.  All 67 of these are eligible to be counted.   \n",
        "ballots are not eligible to be counted.   \n",
        "Motion to count the 67 eligible provisional ballots and not count the 10 ineligible \n",
        "Ms. James stated there were 16 absentee ballots received after the election that are eligible \n",
        "eligible to be counted.  Two of them had a postmark of May 3rd or later.  The third ballot \n",
        "and scanned eligible ballots.     \n"
    ],
    "data/txt/Minutes09272024.txt": [
        "National Change of Address, or NCOA process earlier this month to make our voter rolls \n",
        "schedule.  Mr. Ferrell asked for a list of issues on the ballot; Ms. James stated she would \n"
    ],
    "data/txt/Minutes04012024.txt": [
        "the election that are eligible for counting.  The board members reviewed the ballots.  Ms. \n",
        "Groot motioned to count the 25 eligible absentee ballots, with Ms. Crescimano seconding.  \n",
        "Ms. James stated that eight absentee ballots received after the election are not eligible for \n",
        "not vote there.  All 13 are eligible for counting.  Ms. Crescimano motioned to count the \n",
        "present valid ID to the Board of Elections staff, so their ballots are eligible for counting.  \n",
        "are eligible for counting, per the Election Official Manual.  Ms. Crescimano motioned to\n",
        "are eligible for counting, per the Election Official Manual.  Ms. Crescimano motioned to \n",
        "is eligible for counting.  Ms. Groot motioned to count the ballot, with Ms. Crescimano \n",
        "eligible for counting.  Ms. Groot motioned to count the ballots, with Ms. McKeen \n",
        "ID envelope, they failed to sign, which makes the ballot not eligible for counting.  There are \n",
        "ID.  Therefore, their ballots are not eligible for counting.  Ms. Groot motioned to not count \n",
        "Ohio county 30 days before the election, their ballots are not eligible for counting.  They \n",
        "monthly- one from the state and one from the Department of Health, and then we remove \n",
        "those voters.  However, we cannot remove voters now because we are on a registration \n",
        "Schade to generate a list, so we don’t have a lag time.   \n",
        "scanned eligible 17-year-old, absentee, and provisional ballots.   \n"
    ],
    "data/txt/Minutes04012020.txt": [
        "what’s going on in this office and the challenges this office is having.  We’re not going \n",
        "time worker who was eligible for unemployment through his other job.  She worried \n",
        "list of bills.  Mr. Krabill then rescinded his recusal.    \n"
    ],
    "data/txt/March-13th-2018.txt": [
        "discuss a challenge filed to correct the voter registration list since individuals are \n"
    ],
    "data/txt/Minutes08122021.txt": [
        "their petitions.  Mr. Krabill stated that he would move approval of the entire list as \n",
        "The first name on the list was Donna Green for Huron Board of Education.  Ms. Salyers \n",
        "The second name on the list was Mandi Yetter for Margaretta Board of Education.  She \n",
        "The third name on the list was Abbey Rosado for Kelleys Island Board of Education, \n",
        "The fourth name on the list was Emily Smith for Vermilion Township Trustee.  She had \n",
        "The fifth name on the list was Rosalyn Ahner for Kelleys Island Board of Education.  Ms. \n",
        "The last two names on the list were Ricky McGee for Sandusky Board of Education, and \n",
        "end where we want it.  Mr. Krabill stated he thinks that is one or two steps removed from \n",
        "Ms. Grubbe then asked for a list of PEOs at this time, and said that she was available to be \n"
    ],
    "data/txt/021320Meeting.txt": [
        "The Board will conduct a hearing concerning a Challenge of Right to Vote and \n",
        "Correction of Registration List that was filed with this office. \n"
    ],
    "data/txt/051523Minutes.txt": [
        "administration of voter registrations and elections; \n",
        "• Assisting with voter registration \n",
        "o Giving forms for voter registration drives and instructions \n",
        "o Voter registration - cancellations, dups \n",
        "o Pr~of candidate lists from Secretary of State \n",
        "• Elected officials list \n",
        "o Update list on websi.te \n"
    ],
    "data/txt/Minutes12292023.txt": [
        "Ms. Groot motioned to approve the petitions for the candidates listed on the agenda.  Ms. \n",
        "Ms. Crescimano motioned to accept the candidate name change requests listed on the \n"
    ],
    "data/txt/Minutes07232021.txt": [
        "Director, stated that each board member had a list of candidates to approve in their \n",
        "folders.  Every candidate on the list had enough valid signatures, and from staff’s review, \n",
        "approve the petitions of all the candidates on the list.  Mr. Smith seconded the motion.  \n",
        "Motion carried.  The list of candidates approved, along with the positions they are running \n",
        "seconded by Mr. Krabill.  Motion carried.  The list of issues approved is as follows:  \n",
        "that we do have enough money to obtain the topaz signature pads and to remove the early \n",
        "voting laptops.  Motion to obtain the topaz signature pads and to remove the early voting \n"
    ],
    "data/txt/Minutes06282024.txt": [
        "to approve the issue filings as listed, with Ms. Groot seconding.  All board members voted \n",
        "stamped signature to any changes made.  If you do anything in our voter registration \n"
    ],
    "data/txt/Minutes11072022and11082022.txt": [
        "be challenged.   \n",
        "but they were removed.  He also stated that the second version of the agenda had “old \n",
        "business and new business” but that was removed as well.  He thinks these are intentional \n"
    ],
    "data/txt/Minutes04262024.txt": [
        "before the convention.  Ms. Crescimano stated she received the list of topics Ms. Groot \n",
        "integrity challenges. Lets talk together! Our elections are a Civil Rights matter–impacting every \n",
        "accurately predict voter registration and turnout by age–with no actual historical election data. \n",
        "counties is an indication that voter rolls and votes themselves may have been illegally \n"
    ],
    "data/txt/Minutes06292020.txt": [
        "Ohio against the onslaught of purging by serving as hubs of non-partisan voter registration \n",
        "promoting best practices in expanding access to the polls for all eligible Ohioans; and  \n",
        "levels of public office to open hubs of non-partisan voter registration, where appropriate, \n",
        "Next, Ms. Grubbe thanked staff for providing a list of voters whose party affiliation \n",
        "on the list.  She mentioned one voter who requested a Republican ballot for the primary, \n",
        "but the list had him as undecided.  Ms. Grubbe stated she had many examples like this.  \n"
    ],
    "data/txt/Minutes03132023.txt": [
        "She stated that we received three and all are eligible to be counted.  The first two were sent \n",
        "the 11 provisional ballots eligible to be counted per the Elections Officials Manual.  Two \n",
        "changes where the people did not change their address in time for the voter registration \n",
        "eligible provisional ballots, with Mr. Monaghan seconding.  All board members voted yes; \n",
        "Ms. Link then reviewed five provisional ballots not eligible to be counted per the EOM.  \n",
        "time of the official canvass meeting.  The voter completed a voter registration form and a \n",
        "situation should complete Form 10-U, Affidavit Oath Examination of Person Challenged.  \n",
        "Ms. James stated that one of the absentee ballots the board said was eligible to be counted \n"
    ],
    "data/txt/Minutes09222023.txt": [
        "Ms. James stated that the SOS office provides a very long checklist to use every time you \n",
        "Ms. Crescimano motioned to accept the listed candidates’ petitions for the March 19th, \n"
    ],
    "data/txt/Minutes05172021.txt": [
        "election, so they are eligible to be counted.  The board members took a few moments to \n",
        "Ms. James stated that two absentee ballots are not eligible to be counted.  One was \n",
        "Ms. Link then stated there were seven other provisional ballots that are eligible to be \n",
        "Ms. Link then stated that there were four provisional ballots that are not eligible to be \n",
        "Motion to go into recess while staff opened and scanned eligible absentees and provisionals \n"
    ],
    "data/txt/Minutes08212020.txt": [
        "Vermilion move would be listed as permanent or temporary on the postcards.  Mr. Krabill \n",
        "voter registration.  Boards must take into consideration the amount of staff the board \n",
        "Next, Ms. Salyers stated that she had included in the board members’ packets the list of \n",
        "issues and candidates that would be on the November ballot.  Mr. Smith asked if this list \n",
        "needed to be removed, because they are non-partisan races.  Ms. Salyers stated that she \n",
        "Motion to approve the candidates but to remove the party designation from the judges was \n",
        "Motion to approve the issues listed but to remove the redundancies of having San F and \n",
        "San G listed twice on Issues 1 through 5 was made by Mr. Krabill, seconded by Mr. \n",
        "received from Ms. James a list of confirmed poll workers so far, but she wanted to know \n"
    ],
    "data/txt/Minutes05022022and05032022.txt": [
        "challenges, as well.  The letter is as follows:  \n"
    ],
    "data/txt/Minutes10222021.txt": [
        "numbers match perfectly with the numbers in our voter registration system.   \n"
    ],
    "data/txt/Minutes02052021.txt": [
        "Guests in attendance: Shomore Deniro (listened via teleconference), Amy Grubbe, and \n",
        "stated that he thinks online training is a great idea.  He has witnessed the challenges that \n"
    ],
    "data/txt/Minutes11212022.txt": [
        "election that are eligible to be counted. 30 are regular absentee ballots with a postmark of \n",
        "motion to open and count the 48 eligible absentee ballots, with Mr. Monaghan seconding.  \n",
        "Ms. James stated there are 17 absentee ballots not eligible to be counted because they either \n",
        "Therefore, Ms. James thinks the ballot is eligible to be counted.  Mr. Monaghan made a \n",
        "were cancelled in list maintenance and did not fall under the APRI exception.  They are not \n",
        "were voters who fell under the APRI exception.  This means they were deleted due to list \n",
        "wide voter registration database.  21 were name changes.  Seven were both name changes \n",
        "ballots in this category.  Ms. Link checked the state-wide voter registration database to \n",
        "scan eligible absentee and provisional ballots and research the issue with the late \n"
    ],
    "data/txt/Minutes08312021.txt": [
        "Mr. Krabill stated that one of the bills listed was the board members’ salaries.  He asked if \n",
        "pay.  Mr. Monaghan stated we might want to leave that off the list of bills.  Lori Salyers, \n",
        "voter registration form or absentee ballot application in there.  Mr. Krabill replied that he \n"
    ],
    "data/txt/Minutes01272023.txt": [
        "building.  Ms. James stated yes, but they removed us several years ago.  Mr. Monaghan \n",
        "requested for the director and deputy.  The comp time payout is listed, too.  We discussed \n"
    ],
    "data/txt/Minutes08162024.txt": [
        "Crescimano motioned to approve the issue filings as listed, with Ms. Groot seconding.  All \n",
        "• City of Huron, Charter Amendment, To Remove the Section regarding Allotments \n",
        "Under Old Business was Policy Amendments and Revisions.  Mr. Jones sent a list of \n"
    ],
    "data/txt/Minutes01262024.txt": [
        "the policy book was revised March 8th, 2023, the Board of Elections is not listed as a \n"
    ],
    "data/txt/Minutes08212023.txt": [
        "Twenty absentee ballots received after Election Day are eligible to be counted.  Of those 20, \n",
        "absentee ballots.  Ms. Crescimano motioned to accept the 20 eligible absentee ballots, with \n",
        "eligible to be counted.  Of the ten, five are non-UOCAVA ballots that arrived in the mail \n",
        "review those absentee ballots.  Ms. Crescimano motioned to reject the 10 ineligible absentee \n",
        "160 provisional ballots are eligible to be counted, per the Elections Officials Manual.  Eight \n",
        "Next, Ms. Link presented provisional ballots that are not eligible to be counted.  40 are not \n",
        "stated they no longer reside at the habitation listed in our system.  They completed a 12-B \n",
        "for voter registration.  Staff gave the voter a Vermilion city ballot to vote, then contacted \n",
        "Ms. Crescimano motioned to not count the provisional ballot with a PO box listed as the \n",
        "staff opened ID envelopes and scanned eligible absentee and provisional ballots.   \n",
        "Ms. James stated that while scanning eligible absentee ballots, there was one ballot that \n",
        "Ms. James stated that one eligible provisional ballot would not scan due to the timing \n",
        "The board reconvened at 5:45 p.m.  Ms. James stated we have finished scanning the eligible \n",
        "provisionals eligible to be counted.  Ms. James stated that one provisional voter who voted \n",
        "Election.  Ms. Crescimano motioned to approve the candidates listed, with Mr. Monaghan \n"
    ],
    "data/txt/2025electionscalendar_11x17.pdf.txt": [
        "Dec. 12 Last day for certain local option petitioners to send street listings to Division of Liquor Control (55 days before Feb. 5, 2025 petition filing deadline for May 6, 2025 \n",
        "Jan. 06 Last day for local option petitioners contesting community facility to send street listings to Division of Liquor Control (30 days before Feb. 5 petition filing deadline for May 6 \n",
        "Mar. 25 Boards of elections must advertise in newspaper(s) the places, dates, times, qualifications, and methods for voter registration (6 weeks before primary/special election) R.C. 3503.12 \n",
        "Apr. 07* Deadline for voter registration for May 6 primary/special election (30 days before primary/special election) R.C. 3503.19 \n",
        " Deadline to file corrections and challenges to precinct registration lists (30 days before primary/special election) R.C. 3503.24 \n",
        "Apr. 08 Non-UOCAVA absentee ballots for May 6 primary/special election must be ready (first day after close of voter registration) R.C. 3509.01 \n",
        " Early in-person absentee voting begins (first day after close of voter registration) R.C. 3509.051 \n",
        "Apr. 22 Boards of elections must prepare precinct voter registration lists (14 days before primary/special election) R.C. 3503.23 \n",
        "June 12 Last day for local option petitioners to send street listing to Division of Liquor Control (55 days before Aug. 6 deadline for filing petitions for Nov. 4 general election) R.C. 4301.33, 4305.14 \n",
        "June 24 Boards of elections must advertise in newspaper(s) the places, dates, times, qualifications, and methods for voter registration (6 weeks before special election) R.C. 3503.12\n",
        "July 07* Deadline for voter registration for Aug. 5 special election (30 days before special election) R.C. 3503.19 \n",
        " Deadline to file corrections and challenges to precinct voter registration lists (30 days before special election) R.C. 3503.24 \n",
        " Last day for local option  petitioners seeking to sell at a community facility to send street listing to Division of Liquor Control  \n",
        "July 08 Non-UOCAVA absentee ballots for Aug. 5 special election must be ready (first day after close of voter registration) R.C. 3509.01 \n",
        " Early in-person voting begins (first day after close of voter registration) R.C. 3509.01 \n",
        "July 22 Boards of elections must prepare precinct voter registration lists for special election (14 days before special election) R.C. 3503.23 \n",
        "Sep. 23 Boards of elections must advertise in newspaper(s) the places, dates, times, qualifications, and methods for voter registration (6 weeks before general election) R.C. 3503.12 \n",
        "Oct. 06* Deadline for voter registration for Nov. 4 general election (30 days before general election) R.C. 3503.19 \n",
        "Oct. 09 Deadline to file corrections and challenges to precinct voter registration lists (30 days before general election) R.C. 3503.24 \n",
        "Oct. 07 Non-UOCAVA absentee ballots for Nov. 4 general election must be ready (first day after close of voter registration) R.C. 3509.01 \n",
        " Early in-person voting begins (first day after close of voter registration) R.C. 3509.051 \n",
        "Oct. 21 Boards of elections must prepare precinct voter registration lists for general election (14 days before general election) R.C. 3503.23 \n",
        "Dec. 11 Last day for certain local option petitioners to send street listings to Division of Liquor Control (55 days before Feb. 4 petition filing deadline for May 5, 2026 primary election) R.C. 4301.33, 4305.14 \n",
        "Jan. 05 Last day for local option petitioners contesting community facility to send street listings to Division of Liquor Control (30 days before Feb. 4 petition filing deadline for May 5 \n"
    ],
    "data/txt/Minutes05172023.txt": [
        "There are five that are eligible to be counted because they were received within four days of \n",
        "There are two absentee ballots received after the election that are not eligible to be counted.  \n",
        "Thirteen provisional ballots are eligible to be counted.  Two were name changes, six were \n",
        "did not vote in that county.  Ms. Crescimano made a motion to count the 13 eligible \n",
        "Thirteen provisional ballots are not eligible to be counted.  The first three are not currently \n",
        "registered because they were removed due to list maintenance.  Seven are not registered to \n",
        "election is certified, these people will become registered.  The last three are not eligible to \n",
        "bipartisan board staff scanned eligible absentee and provisional ballots and prepared for \n",
        "Ms. James stated that while opening ID envelopes containing eligible ballots, one ballot was \n",
        "polling location open for Margaretta Township #3, where there were 43 eligible voters.  \n",
        "listen to it.  Mr. Ferrell stated this board needs to be the most transparent board in Erie \n"
    ],
    "data/txt/Minutes04222022.txt": [
        "their leg off.  Do an investigation and listen to the other poll workers.  Ms. James asked, \n"
    ],
    "data/txt/Minutes03242023.3.txt": [
        "Officials Manual, or EOM, if there are fewer than 200 electors in a precinct eligible to vote, \n",
        "is.  For the Huron Township Building, if one eligible voter registers there, the cost per voter \n",
        "eligible voters, the cost per voter would be $16.39.  At the VFW, where there are currently \n",
        "16 eligible voters, the cost per voter would be $45.31.  Ms. James stated that at the last \n",
        "will be eligible to vote.  Ms. Crescimano stated she agreed with that to try to save the \n"
    ],
    "data/txt/06212022Meeting.txt": [
        "The Board will conduct a hearing concerning a Challenge of Right to Vote and \n",
        "Correction of Registration List that was filed with this office. \n"
    ],
    "data/txt/Minutes05312024.txt": [
        "National Change of Address Process and additional list maintenance.  They have a few \n",
        "registration by July 22nd.  We have a list of the 800 voters if anyone wants to see it.   \n",
        "Crescimano motioned to approve the issue filings as listed for the November 2024 Election.  \n"
    ],
    "data/txt/Minutes11202023.txt": [
        "She stated there are 54 that are eligible to be counted.  49 are absentee ballots that were \n",
        "to count the 54 eligible absentee ballots, with Ms. Crescimano seconding.  All board \n",
        "Ms. James stated there are 16 absentee ballots that are not eligible to be counted.  Four are \n",
        "the 16 ineligible absentee ballots, with Ms. Groot seconding.  All board members voted yes; \n",
        "284 provisionals are eligible to be counted.  98 were from voters registered in another Ohio \n",
        "County.  Ms. Crescimano motioned to count the 284 eligible provisional ballots, with Ms. \n",
        "Ms. Link stated that 111 provisional ballots are not eligible to be counted.  However, if the \n",
        "the 77 that were not registered anywhere in Ohio, 11 were removed this year due to no \n",
        "Crescimano motioned to not count the 111 ineligible provisional ballots, with Ms. Groot \n",
        "opened and scanned eligible absentee and provisional ballots.  \n",
        "would be a challenge.  Ms. Link stated she thought we could not have the check-in \n"
    ],
    "data/txt/Minutes11302022.txt": [
        "recall that it was on the agenda and you had it removed.”  He then stated that you can’t \n",
        "recall that it was on the agenda and you had it removed.”  He then stated that you can’t \n"
    ],
    "data/txt/Minutes07262024.txt": [
        "For the Director’s Report, Mr. Jones stated that per state directives, we are doing list \n",
        "maintenance to our voter rolls.  The state will mail absentee ballot requests to registered \n",
        "Access to the servers where the voter registration information is stored should not be \n",
        "Ms. Crescimano stated that the more she listens, she’s really concerned about creating a \n",
        "Ms. Grubbe asked when the voters were removed due to list maintenance.  Ms. James \n",
        "replied that we did that on Monday.  Ms. Grubbe also asked if the office had received a list \n",
        "of voters from the election integrity group that they want removed.  Ms. James stated we \n"
    ],
    "data/txt/Minutes11162020.txt": [
        "these ballots are eligible to be counted.  Motion to count these ballots was made by Mr. \n",
        "November 3 and 13, so they are also eligible to be counted.  Motion to count these ballots \n",
        "later, so they are not eligible to be counted.  She stated that Shomore Deniro from the SOS \n",
        "in the other county, so those ballots are eligible to be counted.  Motion to count these \n",
        "ballots, so their provisional votes are all eligible to be counted.  Motion to count these \n",
        "ballots to our office for tracking purposes, and we noted that in our voter registration \n",
        "These voters were deleted in the “purge” in either 2011, 2013, 2015, 2017, or 2019.  \n",
        "ballots are eligible to be counted.  Motion to count these ballots was made by Mr. \n",
        "anywhere in Ohio, and they were removed from our rolls due to being in prison.  Motion to \n",
        "anywhere in the state of Ohio due to them being removed as part of the “purge” process.  \n",
        "before.  Therefore, they are not eligible to be counted under the APRI exception.  Mr. \n",
        "on the statewide voter registration system.  Mr. Smith stated that now, these people will be \n",
        "Secretary of State.  Mr. Krabill stated that it could be a logistical challenge if we had more \n",
        "provisional ballot if the VLMs were in any way unsure about the person’s eligibility to \n"
    ],
    "data/txt/Minutes06022020.txt": [
        "Ms. Grubbe’s last question was regarding Libby Grant’s name on the website being listed \n"
    ],
    "data/txt/Minutes04232021.txt": [
        "when she reruns the ad if she should list the salary.  Mr. Ferrell stated yes, and reminded \n"
    ],
    "data/txt/Minutes12182024.txt": [
        "us to do this, then he’ll listen.  \n"
    ],
    "data/txt/Minutes11152021.txt": [
        "ballots received after the election.  Thirty-three of them are eligible to be counted because \n",
        "Ms. James then stated there were eight absentee ballots that are not eligible to be counted \n",
        "who confirmed with her that there is no house at the address the two voters listed.  Ms. \n",
        "also stated that she mailed blank voter registration forms to the voters at their old address.  \n",
        "The next three provisional ballots fell under the “registration cancelled/not eligible” \n",
        "category.  All three were deleted from the system due to list maintenance.  Ms. Link noted \n",
        "that in some cases, voters deleted due to list maintenance are still eligible to have their \n",
        "eligible for the exception.  The third ballot was from a voter who was deleted in 2021, but \n",
        "they are also in a completely different precinct, so their ballot is not eligible to be counted.  \n",
        "Mr. Krabill asked if we contact these voters and ask them to fill out a voter registration \n",
        "out serve as voter registration forms as well.   \n",
        "The next three provisional ballots were not eligible to be counted because the yellow \n",
        "The next provisional ballot was not eligible to be counted because the voter did not provide \n",
        "The next seven provisional ballots were not eligible to be counted because they were not \n",
        "Ms. Link stated that the last group of provisional ballots are all eligible to be counted.  The \n",
        "ballot.  Finally, two of the provisional ballots were eligible to be counted due to the APRI \n",
        "Motion to recess while staff members open and scan eligible absentee and provisional \n",
        "Ms. James stated that after scanning all the eligible absentee and provisional ballots, she \n"
    ],
    "data/txt/Minutes01132020.txt": [
        "punches the list on most everything.  She has worked in another office; she has worked \n"
    ],
    "data/txt/Minutes08152022.txt": [
        "Therefore, the ballots are eligible to be counted.  The board members took a few minutes to \n",
        "was their opinion that the ballot was not eligible to be counted, since the voter returned the \n",
        "after the fact.  In my opinion, the ballot is not eligible for counting.”  \n",
        "16 provisional ballots are eligible to be counted.  Five are eligible to be counted because the \n",
        "One provisional ballot was not eligible to be counted because the person was not registered \n",
        "Motion to count the 16 eligible provisional ballots and to reject the one ineligible \n",
        "Hinners, because the agenda lists three separate reasons for going into executive session, \n",
        "Board recessed at 9:48 a.m.  While in recess, board staff opened and scanned eligible \n",
        "redundant, but Ms. Salyers has now parred those down.  She also made a checklist for how \n"
    ],
    "data/txt/Minutes05152020.txt": [
        "the voter registration system in the computer, and the back of the active card is updated as \n"
    ],
    "data/txt/Minutes06012022.txt": [
        "Mr. Stidham, who is chairman of the County Republican party, to remove Republican \n",
        "touch with the campaigns and ask them to remove their own signs.  \n"
    ],
    "data/txt/Minutes01242025.txt": [
        "receive the challenge letter.  \n"
    ]
}